Revit 2024 API
ParameterTypeId.RoofCurveIsSlopeDefining Property
 "Defines Roof Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoofCurveIsSlopeDefining { get; }
Visual Basic
Public Shared ReadOnly Property RoofCurveIsSlopeDefining As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoofCurveIsSlopeDefining {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace